# 10 Minutes pour pandas

In [ ]:
##Importation des librairies

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Création d'objet

In [3]:
#Création d'une série en passant une liste de valeurs
#panda crée par défaut des index de type integer

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
#Création d'une DataFrame en passant un tableau numpy
#Ayant pour index des dates et avec des colonnes nommées

In [7]:
dates = pd.date_range('20130101', periods=7)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2013-01-01 -0.513968  0.517880  0.814763  0.879048
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875
2013-01-04 -0.976315  0.753665 -0.942110  0.773045
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958
2013-01-06  0.631550  1.562260  1.131112  0.455953
2013-01-07  1.414156  0.415353  0.818063  0.619747

In [11]:
#creation de la dataframe en y ajoutant comme paramètres un dictionnaires d'objets 
#pouvant etre convertis comme:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
#Vérification des types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# viewing data

In [14]:
df.head()
#on affiche les 1ère lignes de df

                   A         B         C         D
2013-01-01 -0.513968  0.517880  0.814763  0.879048
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875
2013-01-04 -0.976315  0.753665 -0.942110  0.773045
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958

In [15]:
df.tail(3)
#affichons les 3 premiers lignes de df

                   A         B         C         D
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958
2013-01-06  0.631550  1.562260  1.131112  0.455953
2013-01-07  1.414156  0.415353  0.818063  0.619747

In [16]:
df.index
#affichons les index(noms des lignes) et leur type

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns
#affichons les titres de colonnes et leur type

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values
#les valeurs de la dataframe

array([[-0.513968  ,  0.51787984,  0.81476297,  0.87904805],
       [ 0.29483997, -0.65110439,  0.59283244, -0.04043831],
       [-1.45705304,  0.24644723,  1.13155538,  0.58787503],
       [-0.97631541,  0.75366515, -0.94210967,  0.77304528],
       [ 0.70251112, -0.80087454, -1.09020334, -0.24695849],
       [ 0.63155003,  1.56226031,  1.13111168,  0.45595337],
       [ 1.41415556,  0.41535253,  0.81806303,  0.61974749]])

In [19]:
df.describe()
#description des caractéristiques de la dataframe

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.013674  0.291947  0.350859  0.432610
std    1.026174  0.814333  0.953830  0.420409
min   -1.457053 -0.800875 -1.090203 -0.246958
25%   -0.745142 -0.202329 -0.174639  0.207758
50%    0.294840  0.415353  0.814763  0.587875
75%    0.667031  0.635772  0.974587  0.696396
max    1.414156  1.562260  1.131555  0.879048

In [20]:
#Transposons la data en transformant les colonnes en lignes et les lignes en colonnes
df.T

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,2013-01-07 00:00:00
A,-0.513968,0.294840,-1.457053,-0.976315,0.702511,0.631550,1.414156
B,0.517880,-0.651104,0.246447,0.753665,-0.800875,1.562260,0.415353
C,0.814763,0.592832,1.131555,-0.942110,-1.090203,1.131112,0.818063
D,0.879048,-0.040438,0.587875,0.773045,-0.246958,0.455953,0.619747

In [21]:
#Rangement pas ordre de colonne décroissante
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.879048  0.814763  0.517880 -0.513968
2013-01-02 -0.040438  0.592832 -0.651104  0.294840
2013-01-03  0.587875  1.131555  0.246447 -1.457053
2013-01-04  0.773045 -0.942110  0.753665 -0.976315
2013-01-05 -0.246958 -1.090203 -0.800875  0.702511
2013-01-06  0.455953  1.131112  1.562260  0.631550
2013-01-07  0.619747  0.818063  0.415353  1.414156

In [22]:
#Rangement pas ordre de colonne croissante
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01 -0.513968  0.517880  0.814763  0.879048
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875
2013-01-04 -0.976315  0.753665 -0.942110  0.773045
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958
2013-01-06  0.631550  1.562260  1.131112  0.455953
2013-01-07  1.414156  0.415353  0.818063  0.619747

In [23]:
df.sort_values(by='B')
#rangement par ordre de la colonne B

                   A         B         C         D
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875
2013-01-07  1.414156  0.415353  0.818063  0.619747
2013-01-01 -0.513968  0.517880  0.814763  0.879048
2013-01-04 -0.976315  0.753665 -0.942110  0.773045
2013-01-06  0.631550  1.562260  1.131112  0.455953

# Selection¶

Bien que les expressions Python / Numpy standard pour la sélection et le paramétrage soient intuitives et utiles pour le travail interactif, pour le code de production, les méthodes optimisées d'accès aux données pandas, .at, .iat, .loc, .iloc et .ix sont recommandées.

# Getting

In [24]:
df['A']
#affichage de la colonne A

2013-01-01   -0.513968
2013-01-02    0.294840
2013-01-03   -1.457053
2013-01-04   -0.976315
2013-01-05    0.702511
2013-01-06    0.631550
2013-01-07    1.414156
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]
#les 3 premieres lignes

                   A         B         C         D
2013-01-01 -0.513968  0.517880  0.814763  0.879048
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875

In [26]:
df['20130102':'20130104']
#affichage des lignes coprises entre les valeurs

                   A         B         C         D
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875
2013-01-04 -0.976315  0.753665 -0.942110  0.773045

# Selection by Label

In [27]:
df.loc[dates[0]]
#affichage des valeurs dont le nom de ligne est la première date

A   -0.513968
B    0.517880
C    0.814763
D    0.879048
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:,['A','B']]
#affichage des colonnes A et B et de toutes les lignes

                   A         B
2013-01-01 -0.513968  0.517880
2013-01-02  0.294840 -0.651104
2013-01-03 -1.457053  0.246447
2013-01-04 -0.976315  0.753665
2013-01-05  0.702511 -0.800875
2013-01-06  0.631550  1.562260
2013-01-07  1.414156  0.415353

In [29]:
#affichage de la sequence de date(les deux extrémités sont incluses) et des 2 colonnes A et B 
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.294840 -0.651104
2013-01-03 -1.457053  0.246447
2013-01-04 -0.976315  0.753665

In [30]:
#affichage de l'intersection des colonnes A et B et de la ligne de nom la date 
#Réduction des dimensions de l'objet retourné
df.loc['20130102',['A','B']]

A    0.294840
B   -0.651104
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.loc[dates[0],'A']
#intersection de la colonne A et de la première date
#Pour obtenir une valeur scalaire

-0.513968003177668

In [34]:
df.at[dates[0],'A']
#Pour obtenir un accès rapide à un scalaire (équivaut à la méthode antérieure)

-0.513968003177668

In [33]:
df.loc['20130101','A']

-0.513968003177668

# Selection by Position

In [35]:
df.iloc[3]
#Sélectionnez via la position des entiers passés en paramètre

A   -0.976315
B    0.753665
C   -0.942110
D    0.773045
Name: 2013-01-04 00:00:00, dtype: float64

In [38]:
df.iloc[3:4,0:2]
#Par tranches entières, agissant comme numpy / python

                   A         B
2013-01-04 -0.976315  0.753665

In [39]:
df.iloc[[1,2,4],[0,2]]
#iloc selectionne les emplacements
#Par des listes d'emplacements de positions entières, semblables au style numpy / python

                   A         C
2013-01-02  0.294840  0.592832
2013-01-03 -1.457053  1.131555
2013-01-05  0.702511 -1.090203

In [40]:
#Pour trancher des lignes explicitement
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-03 -1.457053  0.246447  1.131555  0.587875

In [41]:
#Pour couper des colonnes explicitement
df.iloc[:,1:3]

                   B         C
2013-01-01  0.517880  0.814763
2013-01-02 -0.651104  0.592832
2013-01-03  0.246447  1.131555
2013-01-04  0.753665 -0.942110
2013-01-05 -0.800875 -1.090203
2013-01-06  1.562260  1.131112
2013-01-07  0.415353  0.818063

In [42]:
df.iloc[1,1]
#on obtient une valeur explicitement

-0.65110438932120251

In [46]:
 df.iat[1,1]
#Pour obtenir un accès rapide à un scalaire (équivaut à la méthode antérieure)

-0.65110438932120251

# Boolean Indexing

In [48]:
#Utilisation des valeurs d'une seule colonne pour sélectionner des données.
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.294840 -0.651104  0.592832 -0.040438
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958
2013-01-06  0.631550  1.562260  1.131112  0.455953
2013-01-07  1.414156  0.415353  0.818063  0.619747

In [49]:
df[df > 0]
#filtrage pour les éléments(affichage des éléments positifs)

                   A         B         C         D
2013-01-01       NaN  0.517880  0.814763  0.879048
2013-01-02  0.294840       NaN  0.592832       NaN
2013-01-03       NaN  0.246447  1.131555  0.587875
2013-01-04       NaN  0.753665       NaN  0.773045
2013-01-05  0.702511       NaN       NaN       NaN
2013-01-06  0.631550  1.562260  1.131112  0.455953
2013-01-07  1.414156  0.415353  0.818063  0.619747

In [60]:
#Utilisation de la méthode isin () pour le filtrage:
#copie de df dans df2
df2 = df.copy()

In [65]:
#ajout d'une nouvelle colonne
df2['E'] = ['one', 'one','two','three','four','three', 'two']
df2

                   A         B         C         D      E
2013-01-01 -0.513968  0.517880  0.814763  0.879048    one
2013-01-02  0.294840 -0.651104  0.592832 -0.040438    one
2013-01-03 -1.457053  0.246447  1.131555  0.587875    two
2013-01-04 -0.976315  0.753665 -0.942110  0.773045  three
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958   four
2013-01-06  0.631550  1.562260  1.131112  0.455953  three
2013-01-07  1.414156  0.415353  0.818063  0.619747    two

In [66]:
df2[df2['E'].isin(['two','four'])]
#partie de la dataframe avec two et four

                   A         B         C         D     E
2013-01-03 -1.457053  0.246447  1.131555  0.587875   two
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958  four
2013-01-07  1.414156  0.415353  0.818063  0.619747   two

# Setting

La définition d'une nouvelle colonne aligne automatiquement les données par les index

In [77]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
#on créée des séries
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [78]:
df['F'] = s1

In [79]:
df

                   A         B         C         D    F
2013-01-01 -0.513968  0.517880  0.814763  0.879048  NaN
2013-01-02  0.294840 -0.651104  0.592832 -0.040438  1.0
2013-01-03 -1.457053  0.246447  1.131555  0.587875  2.0
2013-01-04 -0.976315  0.753665 -0.942110  0.773045  3.0
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958  4.0
2013-01-06  0.631550  1.562260  1.131112  0.455953  5.0
2013-01-07  1.414156  0.415353  0.818063  0.619747  6.0

In [80]:
df.at[dates[0],'A'] = 0
#affectation de la valeur 0 par libellé

In [81]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.517880  0.814763  0.879048  NaN
2013-01-02  0.294840 -0.651104  0.592832 -0.040438  1.0
2013-01-03 -1.457053  0.246447  1.131555  0.587875  2.0
2013-01-04 -0.976315  0.753665 -0.942110  0.773045  3.0
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958  4.0
2013-01-06  0.631550  1.562260  1.131112  0.455953  5.0
2013-01-07  1.414156  0.415353  0.818063  0.619747  6.0

In [82]:
df.iat[0,1] = 0
#affectation de la valeur 0 par position
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.814763  0.879048  NaN
2013-01-02  0.294840 -0.651104  0.592832 -0.040438  1.0
2013-01-03 -1.457053  0.246447  1.131555  0.587875  2.0
2013-01-04 -0.976315  0.753665 -0.942110  0.773045  3.0
2013-01-05  0.702511 -0.800875 -1.090203 -0.246958  4.0
2013-01-06  0.631550  1.562260  1.131112  0.455953  5.0
2013-01-07  1.414156  0.415353  0.818063  0.619747  6.0

In [84]:
#Réglage par assignation avec un tableau numpy
df.loc[:,'D'] = np.array([5] * len(df))
#on mets un numpy array dans la colonne D

In [85]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.814763  5  NaN
2013-01-02  0.294840 -0.651104  0.592832  5  1.0
2013-01-03 -1.457053  0.246447  1.131555  5  2.0
2013-01-04 -0.976315  0.753665 -0.942110  5  3.0
2013-01-05  0.702511 -0.800875 -1.090203  5  4.0
2013-01-06  0.631550  1.562260  1.131112  5  5.0
2013-01-07  1.414156  0.415353  0.818063  5  6.0

In [86]:
df2 = df.copy()
#pour une copie de dataframe
df2[df2 > 0] = -df2
df2
#nous avons affecté des moins aux valeurs positives de df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.814763 -5  NaN
2013-01-02 -0.294840 -0.651104 -0.592832 -5 -1.0
2013-01-03 -1.457053 -0.246447 -1.131555 -5 -2.0
2013-01-04 -0.976315 -0.753665 -0.942110 -5 -3.0
2013-01-05 -0.702511 -0.800875 -1.090203 -5 -4.0
2013-01-06 -0.631550 -1.562260 -1.131112 -5 -5.0
2013-01-07 -1.414156 -0.415353 -0.818063 -5 -6.0

# Missing Data

Pandas utilise principalement la valeur np.nan pour représenter les données manquantes. Il est par défaut non inclus dans les calculs.
La réinitialisation vous permet de modifier / ajouter / supprimer l'index sur un axe spécifié. Cela retourne une copie des données.

In [87]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
#reecrire la dataframe
df1.loc[dates[0]:dates[1],'E'] = 1
#assigner les valeurs a 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.814763  5  NaN  1.0
2013-01-02  0.294840 -0.651104  0.592832  5  1.0  1.0
2013-01-03 -1.457053  0.246447  1.131555  5  2.0  NaN
2013-01-04 -0.976315  0.753665 -0.942110  5  3.0  NaN

In [88]:
df1.dropna(how='any')
#supprimer les lignes en na

                  A         B         C  D    F    E
2013-01-02  0.29484 -0.651104  0.592832  5  1.0  1.0

In [89]:
df1.fillna(value=5)
#assigner les valeurs na a 5

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.814763  5  5.0  1.0
2013-01-02  0.294840 -0.651104  0.592832  5  1.0  1.0
2013-01-03 -1.457053  0.246447  1.131555  5  2.0  5.0
2013-01-04 -0.976315  0.753665 -0.942110  5  3.0  5.0

In [90]:
pd.isnull(df1)
#pour tester les valeurs booléenes

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

## Stats


Les opérations en général excluent les données manquantes.

Effectuons une statistique descriptive

In [91]:
df.mean()
#les opérations sont sans les na
#ici on a la moyenne par colonne

A    0.087098
B    0.217964
C    0.350859
D    5.000000
F    3.500000
dtype: float64

In [92]:
df.mean(1)
#moyenne de la premiere colonnne

2013-01-01    1.453691
2013-01-02    1.247314
2013-01-03    1.384190
2013-01-04    1.367048
2013-01-05    1.562287
2013-01-06    2.664984
2013-01-07    2.729514
Freq: D, dtype: float64


Fonctionnement avec des objets qui ont une dimension différente et ont besoin d'alignement. En outre, les pandas diffusent automatiquement le long de la dimension spécifiée.

In [94]:
s = pd.Series([1,3,5,np.nan,6,8,10], index=dates).shift(2)
s
#le paramètre shift rajoute les NA

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
2013-01-07    6.0
Freq: D, dtype: float64

In [95]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.457053 -0.753553  0.131555  4.0  1.0
2013-01-04 -3.976315 -2.246335 -3.942110  2.0  0.0
2013-01-05 -4.297489 -5.800875 -6.090203  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN
2013-01-07 -4.585844 -5.584647 -5.181937 -1.0  0.0

## Apply

Application des fonctions aux données

In [96]:
df.apply(np.cumsum)
#application de la fonction np.cumsum à df

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.814763   5   NaN
2013-01-02  0.294840 -0.651104  1.407595  10   1.0
2013-01-03 -1.162213 -0.404657  2.539151  15   3.0
2013-01-04 -2.138528  0.349008  1.597041  20   6.0
2013-01-05 -1.436017 -0.451867  0.506838  25  10.0
2013-01-06 -0.804467  1.110394  1.637949  30  15.0
2013-01-07  0.609688  1.525746  2.456012  35  21.0

In [97]:
df.apply(lambda x: x.max() - x.min())
#lambda

A    2.871209
B    2.363135
C    2.221759
D    0.000000
F    5.000000
dtype: float64

## Histogramming

In [98]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    5
2    4
3    3
4    3
5    3
6    3
7    5
8    5
9    3
dtype: int32

In [99]:
s.value_counts()
#On compte les valeurs

3    5
5    3
6    1
4    1
dtype: int64

## String Methods


Series est équipé d'un ensemble de méthodes de traitement de chaîne dans l'attribut str qui le rendent facile à utiliser sur chaque élément du tableau, comme dans l'extrait de code ci-dessous. Notez que le pattern-matching dans str utilise généralement des expressions régulières par défaut (et dans certains cas les utilise toujours).

In [103]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()
#on change les majuscules en miniscules

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## Concat


Pandas offre diverses facilités pour combiner facilement des objets Series, DataFrame et Panel avec différents types de logique de consigne pour les index et la fonctionnalité d'algèbre relationnelle dans le cas d'opérations de type join / merge.


Concaténation des objets pandas avec concat ():

In [101]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.936473  0.180619  0.557615 -2.264918
1  1.872519  1.210570 -0.965412  0.881055
2  1.098156  0.429437 -0.654201 -0.825659
3 -0.507125 -0.640069  0.389880 -0.651128
4 -1.334944 -1.251753  0.655853  0.396805
5  0.236843  0.860516 -1.061653 -0.584212
6 -1.877063  1.000387 -0.069069 -0.473818
7  0.247067 -0.934605  1.495215 -0.629311
8 -0.511735 -1.123899 -1.361332  1.167946
9 -0.799702 -0.951788 -0.143967  0.387194

In [102]:
pieces = [df[:3], df[3:7], df[7:]]
#decoupe la dataframe en pieces
pieces

[          0         1         2         3
 0 -0.936473  0.180619  0.557615 -2.264918
 1  1.872519  1.210570 -0.965412  0.881055
 2  1.098156  0.429437 -0.654201 -0.825659,
           0         1         2         3
 3 -0.507125 -0.640069  0.389880 -0.651128
 4 -1.334944 -1.251753  0.655853  0.396805
 5  0.236843  0.860516 -1.061653 -0.584212
 6 -1.877063  1.000387 -0.069069 -0.473818,
           0         1         2         3
 7  0.247067 -0.934605  1.495215 -0.629311
 8 -0.511735 -1.123899 -1.361332  1.167946
 9 -0.799702 -0.951788 -0.143967  0.387194]

In [104]:
pd.concat(pieces)
#pour concatener les pieces en dataframe

          0         1         2         3
0 -0.936473  0.180619  0.557615 -2.264918
1  1.872519  1.210570 -0.965412  0.881055
2  1.098156  0.429437 -0.654201 -0.825659
3 -0.507125 -0.640069  0.389880 -0.651128
4 -1.334944 -1.251753  0.655853  0.396805
5  0.236843  0.860516 -1.061653 -0.584212
6 -1.877063  1.000387 -0.069069 -0.473818
7  0.247067 -0.934605  1.495215 -0.629311
8 -0.511735 -1.123899 -1.361332  1.167946
9 -0.799702 -0.951788 -0.143967  0.387194

## Join

Fusion de type SQL

In [105]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [106]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [107]:
pd.merge(left, right, on='key')
#on fusionne les 2 cotés à l'aide de la clé en donnant les différentes possibilités de combinaison sur la clé

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Un autre exemple

In [109]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  bar     2

In [111]:
right

   key  rval
0  foo     4
1  bar     5

In [112]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Append


Ajouter des lignes à un dataframe

In [114]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.387215  0.742403 -0.323312 -0.967424
1  0.190172  0.366397 -1.187627  0.872104
2  0.139535 -2.355968  1.162955  1.844268
3 -0.213234  1.446290  0.147828  0.645198
4  0.277099  0.328397  1.661229  0.109314
5 -0.495595 -0.007034  1.056742 -1.225550
6 -0.640872 -0.058178  0.456706 -0.160513
7  1.174329 -0.283353 -0.390035 -1.406756

In [115]:
s = df.iloc[3]
#la 4eme ligne
s

A   -0.213234
B    1.446290
C    0.147828
D    0.645198
Name: 3, dtype: float64

In [116]:
df.append(s, ignore_index=True)
#ajout de la ligne s a df

          A         B         C         D
0 -0.387215  0.742403 -0.323312 -0.967424
1  0.190172  0.366397 -1.187627  0.872104
2  0.139535 -2.355968  1.162955  1.844268
3 -0.213234  1.446290  0.147828  0.645198
4  0.277099  0.328397  1.661229  0.109314
5 -0.495595 -0.007034  1.056742 -1.225550
6 -0.640872 -0.058178  0.456706 -0.160513
7  1.174329 -0.283353 -0.390035 -1.406756
8 -0.213234  1.446290  0.147828  0.645198

## Grouping


Par "group by", on entend un processus impliquant une ou plusieurs des étapes suivantes

    -Diviser les données en groupes en fonction de certains critères
    -Appliquer une fonction à chaque groupe indépendamment
    -Combiner les résultats dans une structure de données

In [117]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
   ....: 

df

     A      B         C         D
0  foo    one -1.980625  0.416796
1  bar    one  0.442870  0.510520
2  foo    two -0.377809 -0.562172
3  bar  three  1.747947  0.108339
4  foo    two -2.288917 -0.402565
5  bar    two -0.142850 -1.300010
6  foo    one -1.566260  0.592067
7  foo  three -1.379151  1.305208

In [119]:
#Grouper puis appliquer une somme de fonction aux groupes résultants.
df.groupby('A').sum()

            C         D
A
bar  2.047967 -0.681152
foo -7.592763  1.349334

In [120]:
#Le regroupement par plusieurs colonnes forme un index hiérarchique, que nous appliquons ensuite à la fonction.
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.442870  0.510520
    three  1.747947  0.108339
    two   -0.142850 -1.300010
foo one   -3.546885  1.008863
    three -1.379151  1.305208
    two   -2.666726 -0.964737

# Reshaping

## Stack

In [121]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
   ....: 

tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [122]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [123]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.462409 -1.110591
      two     1.033683 -2.358086
baz   one    -1.232778 -1.956617
      two     0.521919 -1.371447


La méthode stack () "compresse" un niveau dans les colonnes du DataFrame.

In [124]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.462409
               B   -1.110591
       two     A    1.033683
               B   -2.358086
baz    one     A   -1.232778
               B   -1.956617
       two     A    0.521919
               B   -1.371447
dtype: float64


Avec un DataFrame ou une série "empilés" (ayant un index MultiIndex), l'opération inverse de stack () est unstack (), qui désempile par défaut le dernier niveau:

In [125]:
stacked.unstack()

                     A         B
first second
bar   one     0.462409 -1.110591
      two     1.033683 -2.358086
baz   one    -1.232778 -1.956617
      two     0.521919 -1.371447

In [126]:
stacked.unstack(1)

second        one       two
first
bar   A  0.462409  1.033683
      B -1.110591 -2.358086
baz   A -1.232778  0.521919
      B -1.956617 -1.371447

In [127]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.462409 -1.232778
       B -1.110591 -1.956617
two    A  1.033683  0.521919
       B -2.358086 -1.371447

## Pivot Tables

In [128]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
   .....: 

df

        A  B    C         D         E
0     one  A  foo -0.639485 -0.964371
1     one  B  foo  0.629613  0.643450
2     two  C  foo -0.634303  1.161940
3   three  A  bar  0.820344  0.607746
4     one  B  bar -0.720731  0.278308
5     one  C  bar  1.968914 -1.441464
6     two  A  foo -0.358705  0.386586
7   three  B  foo -0.565119  1.069813
8     one  C  foo -0.745995 -0.502017
9     one  A  bar  1.065218  0.546945
10    two  B  bar  1.059209 -1.555646
11  three  C  bar  0.289776  1.494723


Nous pouvons produire des tableaux croisés à partir de ces données très facilement:

In [129]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.065218 -0.639485
      B -0.720731  0.629613
      C  1.968914 -0.745995
three A  0.820344       NaN
      B       NaN -0.565119
      C  0.289776       NaN
two   A       NaN -0.358705
      B  1.059209       NaN
      C       NaN -0.634303